[
  {
    "path": "posts/2022-03-13-urchins/",
    "title": "Santa Barbara LTER Urchins",
    "description": "This report analyzes sea urchin data from the Santa Barbara Coastal Long Term Ecological Research program.",
    "author": [
      {
        "name": "Karina Johnston",
        "url": {}
      }
    ],
    "date": "2022-03-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nRead in the data\r\nSection 1: Size comparisons (all data)\r\nSection 2: Purple urchins (by site and year)\r\nCitations\r\n\r\nThis report analyzes sea urchin data from the Santa Barbara Coastal Long Term Ecological Research program. Data for both red (Mesocentrotus franciscanus) and purple (Strongylocentrotus purpuratus) urchins observed at five sites along the Santa Barbara coast are analyzed. Final Figures and Tables are produced, exploring data visualization techniques and summary statistics.\r\nCitation: Reed, D. 2020. SBC LTER: Reef: Long-term experiment: Kelp removal: Urchin size frequency distribution ver 20. Environmental Data Initiative. Accessed 2010-10-27. (https://doi.org/10.6073/pasta/5a1e9ef03aa47bd2225c0bb98a02a63b)\r\n\r\n\r\nhide\r\n\r\nknitr::opts_chunk$set(echo = TRUE, warning = FALSE, message = FALSE)\r\n\r\n# Attach the following packages into the setup code chunk and change the settings for reporting warnings and messages (above)\r\nlibrary(tidyverse)\r\nlibrary(kableExtra)\r\nlibrary(here)\r\nlibrary(janitor)\r\nlibrary(lubridate)\r\n\r\n\r\n\r\nRead in the data\r\nThis step reads in the urchin data .csv file from within the project folder and creates a new dataframe urchin_data, followed by a step to change the column headers to lower snake case using the function clean_names() found in the janitor package.\r\n\r\n\r\nhide\r\n\r\nurchin_data <- read_csv(here(\"data\", \"urchins.csv\")) %>% \r\n  clean_names()\r\n\r\n\r\n\r\nSection 1: Size comparisons (all data)\r\nIn this section, the data will be visualized first by comparing the distributions of sizes between purple and red urchins with a finalized, faceted histogram using the ggplot() function with cleaned up aesthetics.\r\n\r\n\r\nhide\r\n\r\n# creates a histogram based on urchin size and changes the bar colors based on the species\r\nggplot(data = urchin_data, aes(x = size, fill = common_name)) + \r\n\r\n# geometry for histogram and changes bin number to better represent the data\r\n  geom_histogram(bins = 13, color = \"black\") + \r\n  \r\n# fills the bins with colors corresponding to species\r\n  scale_fill_manual(values = c(\"Purple\", \"Red\")) + \r\n  facet_wrap(~ common_name) + # splits graph by species\r\n  labs(x = \"Diameter (cm)\", # updates titles\r\n       y = \"Number of urchins\", \r\n       title = \"Size Frequency Histogram for Santa Barbara Urchins (Johnston)\") +\r\n  theme_bw() + # cleaner graph\r\n  theme(plot.title = element_text(hjust = 0.5), # centered title\r\n        panel.grid = element_blank()) + # removes gridlines\r\n  \r\n  guides(fill = FALSE) # removes unnecessary legend\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1. Diameter size frequency data (cm) for Santa Barbara coastal red and purple urchins (data: SBC LTER).\r\n\r\n\r\n\r\nNext, a finalized summary table is created that contains the following statistics for purple and red urchins (mean, standard deviation or SD, and sample size). This code contains many aesthetic alterations for cleaner visibility and labeling, including updated column header names, adding comma separators for thousands, adding a caption, and rounding the digits.\r\n\r\n\r\nhide\r\n\r\nurchin_size_stats <- urchin_data %>% \r\n\r\n# these functions group by species and produce the summary statistics (rounded)\r\n  group_by(common_name) %>% \r\n  summarize(mean_size_cm = round(mean(size), 2),\r\n            median_size_cm = round(median(size), 1),\r\n            sd_size = round(sd(size), 2),\r\n            sample_size = n())\r\n\r\n# these functions update the table to be cleaner, easier to read, and visually appealing\r\nkable(urchin_size_stats,\r\n      col.names = c(\"Common Name\", # changes the column names\r\n                    \"Mean Diameter (cm)\", \r\n                    \"Median Diameter (cm)\",\r\n                    \"Standard Deviation (cm)\",\r\n                    \"Sample Size\"),\r\n      align = \"lcccc\", # changes the alignment of the columns\r\n      format.args = list(big.mark = \",\"), # adds comma separator\r\n\r\n# adds a caption\r\n      caption = \"Table 1. Summary statistics for red and purple urchins on the Santa Barbara coast (Johnston) (data: SBC LTER).\") %>% \r\n\r\n# better lines within the table\r\nkable_classic(full_width = F)\r\n\r\n\r\n\r\nTable 1: Table 1. Summary statistics for red and purple urchins on the Santa Barbara coast (Johnston) (data: SBC LTER).\r\n\r\n\r\nCommon Name\r\n\r\n\r\nMean Diameter (cm)\r\n\r\n\r\nMedian Diameter (cm)\r\n\r\n\r\nStandard Deviation (cm)\r\n\r\n\r\nSample Size\r\n\r\n\r\nPurple Urchin\r\n\r\n\r\n4.47\r\n\r\n\r\n4.5\r\n\r\n\r\n1.18\r\n\r\n\r\n31,805\r\n\r\n\r\nRed Urchin\r\n\r\n\r\n6.78\r\n\r\n\r\n7.0\r\n\r\n\r\n1.89\r\n\r\n\r\n27,408\r\n\r\n\r\nBased on the urchin size data visualizations in Figure 1 and the summary statistics presented in Table 1, several patterns emerge about the urchin size data. The central tendency and data spread of urchin size by species (mean \\(\\pm\\) SD) showed larger red urchins (6.78 \\(\\pm\\) 1.89) than purple urchins (4.47 \\(\\pm\\) 1.18); the mean of red urchins was 34% larger than purples. The median showed a similar pattern (7.0 and 4.5, respectively). Both sample sizes were quite large (> 27,000 individual urchins for each). From the histogram visualization (Figure 1), both species of urchins appear to be normally distributed.\r\nSection 2: Purple urchins (by site and year)\r\nIn this Section, the purple urchin data will be explored by site and year. In this code chunk, the data are filtered for purple urchins, date is converted to class “Date”, and new columns are added.\r\n\r\n\r\nhide\r\n\r\n# creates the new dataframe beginning with urchin_data\r\npurple_urchins <- urchin_data %>% \r\n  filter(common_name == \"Purple Urchin\") %>% # filters only purple rows\r\n\r\n# updates the date column to be Date format and adds a year column \r\n  mutate(date = mdy(date)) %>% \r\n  mutate(year = year(date)) %>% \r\n\r\n# adds a new column called \"site_full\" that includes the full site names\r\n  mutate(site_full = case_when(\r\n    site == \"NAPL\" ~ \"Naples Reef\",\r\n    site == \"AQUE\" ~ \"Arroyo Quemado Reef\",\r\n    site == \"CARP\" ~ \"Carpinteria Reef\",\r\n    site == \"MOHK\" ~ \"Mohawk Reef\",\r\n    site == \"IVEE\" ~ \"Isla Vista Reef\"\r\n  ))\r\n\r\n\r\n\r\nThis code stores a table (purple_urchin_summary) containing the total number of purple urchins observed by site and year (not a final formatted table).\r\n\r\n\r\nhide\r\n\r\npurple_urchin_summary <- purple_urchins %>% \r\n  count(site_full, year)\r\n\r\n\r\n\r\nVisualizing the data\r\nThis step visualizes the data through a final graph showing counts of purple urchins recorded at each site over time for the years included in the study.\r\n\r\n\r\nhide\r\n\r\n# creates a bar graph (column geometry) using purple_urchin_summary dataframe and fills the color by site name\r\nggplot(data = purple_urchin_summary, aes(x = year, y = n, fill = site_full)) +\r\n  geom_col(color = \"black\") +\r\n\r\n# updates the axes/title names\r\n  labs(x = \"Year\", y = \"Urchin Count\",\r\n       title = \"Purple urchin count by site over time (Johnston)\") +\r\n\r\n# wraps by site (splits the graph)\r\n  facet_wrap(~ site_full) +\r\n  theme_bw() + # cleaner theme\r\n  theme(plot.title = element_text(hjust = 0.5), # centers title\r\n        panel.grid.minor = element_blank() # removes major gridlines\r\n        ) +\r\n\r\n# changes fill colors to be more aesthetic\r\n  scale_fill_manual(values = c(\"purple\", \"blue\", \r\n                               \"dark green\", \"dark red\", \"orange\")) +\r\n\r\n# removes unnecessary legend\r\n  guides(fill = FALSE)\r\n\r\n\r\n\r\n\r\nFigure 2: Figure 2. Purple urchin counts by site in Santa Barbara, 2008-2020 (data: SBC LTER).\r\n\r\n\r\n\r\nThe purple urchin counts drop consistently across all sites in 2013, with a continuing decline through 2020, though at some sites, the 2020 counts are similar to the initial baseline survey year in 2008. The decline may not be reflective of urchin population changes. Other factors that would be important to determining actual changes in population sizes include sample size and effect, number or types of treatments, etc. Since these are reflective of kelp removal data, it may be that there is a confounding factor that is not acknowledged in these data based on the merging of all treatments together. There could also be changes in sampling effort across years that would affect the total counts (e.g., Covid-19 may have reduced survey frequency in 2020).\r\nCitations\r\nFirke, Sam (2021). janitor: Simple Tools for Examining and Cleaning Dirty Data. R package version 2.1.0. https://CRAN.R-project.org/package=janitor\r\nGrolemund, Garrett, Hadley Wickham (2011). Dates and Times Made Easy with lubridate. Journal of Statistical Software, 40(3), 1-25. URL https://www.jstatsoft.org/v40/i03/.\r\nReed, D. 2020. SBC LTER: Reef: Long-term experiment: Kelp removal: Urchin size frequency distribution ver 20. Environmental Data Initiative. Accessed 2010-10-27. (https://doi.org/10.6073/pasta/5a1e9ef03aa47bd2225c0bb98a02a63b)\r\nWickham et al., (2019). Welcome to the tidyverse. Journal of Open Source Software, 4(43), 1686, https://doi.org/10.21105/joss.01686\r\nZhu, Hao (2021). kableExtra: Construct Complex Table with ‘kable’ and Pipe Syntax. R package version 1.3.4. https://CRAN.R-project.org/package=kableExtra\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-13-urchins/urchins_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-03-13T11:51:10-07:00",
    "input_file": "urchins.knit.md"
  },
  {
    "path": "posts/2022-03-13-snowshoe/",
    "title": "Bonanza Creek Hares Report",
    "description": "This report analyzes juvenile snowshoe hare data from the Bonanza Creek Long Term Ecological Research program.",
    "author": [
      {
        "name": "Karina Johnston",
        "url": {}
      }
    ],
    "date": "2022-03-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nData and Analyses\r\nSummary of Findings\r\nCitations\r\n\r\n\r\n\r\nhide\r\n\r\nknitr::opts_chunk$set(echo = TRUE, warning = FALSE, message = FALSE)\r\n\r\n# Attach packages\r\nlibrary(tidyverse) # graphs and visualizations (ggplot) and many functions\r\nlibrary(here) # standardized project pathways\r\nlibrary(equatiomatic) # output professional equations\r\nlibrary(lubridate) # to mutate the date format\r\nlibrary(kableExtra) # to create professional tables\r\nlibrary(broom) # help summarize statistical models\r\nlibrary(effsize) # for Cohen's d effect size\r\nlibrary(RColorBrewer) # customized color palettes\r\n\r\n\r\n\r\nIntroduction\r\nSnowshoe hares, Lepus americanus, are a keystone prey species in northern boreal forests (Kielland et al. 2017); hare populations have been known to vary seasonally and in response to changing conditions such as food availability (Feierabend et al. 2014). Snowshoe hare population abundance and density in Alaska are studied by the Bonanza Creek Long Term Ecological Research (LTER) program, which is part of the US LTER Network (https://www.lter.uaf.edu/). Hare population estimates are monitored in conjunction with other snowshoe hare population estimates by federal agencies based on pellet and road counts elsewhere within the state (Bonanza LTER website). In this report, the counts, sizes, and other characteristics of juvenile snowshoe hares recorded in a database from 1998-2012 will be explored.\r\nData and Analyses\r\nKielland et al. (2017) open source LTER data are used from a capture-recapture study conducted on snowshoe hares at five sites in the Tanana Valley, Alaska, USA. Specific relationships and visualizations that will be explored for juvenile hares include annual counts, juvenile weights (g) by sex and site location, and an exploratory analysis to look at the potential relationship between juvenile weights (g) and hind foot length (mm).\r\nData are provided by the Bonanza Creek LTER, a partnership between the University of Alaska Fairbanks, and the U.S. Forest Service. Experimental design and data collection methods can be found in Flora (2002). Significant funding for collection of these data was provided by the National Science Foundation Long-Term Ecological Research program (NSF Grant numbers DEB-1636476, DEB-1026415, DEB-0620579, DEB-0423442, DEB-0080609, DEB-9810217, DEB-9211769, DEB-8702629) and by the USDA Forest Service, Pacific Northwest Research Station (Agreement # RJVA-PNW-01-JV-11261952-231).\r\nSpecific relationships and visualizations that will be explored for juvenile hares include annual counts, juvenile weights (g) by sex and site location, and an exploratory analysis to look at the potential relationship between juvenile weights (g) and hind foot length (mm) using correlation and a linear regression model. A significance level (\\(\\alpha\\)) of 0.05 is used throughout the report. All analyses are in R Version 4.0.2 using RStudio Version 1.4.1717.\r\nAnnual juvenile hare trap counts\r\nThe total number of juvenile snowshoe hare trappings are counted for each year of the study (1998 - 2012) in Figure 1.\r\n\r\n\r\nhide\r\n\r\n# this code chunk mutates the data such that years will be cleanly organized \r\nbonanza_newdates <- bonanza_hares %>%  # creates a new dataframe beginning with bonanza_hares\r\n  mutate(date_new = mdy(date)) %>%  # creates a new column using `lubridate::mdy()`\r\n  mutate(year_new = year(date_new))  # creates a new year column\r\n\r\n# this code chunk creates a new dataframe filtering for juveniles\r\nbonanza_juveniles <- bonanza_newdates %>%\r\n  filter(age == \"j\")\r\n\r\n# this code chunk creates summary statistics\r\nbonanza_stats <- bonanza_juveniles %>% # groups by year and counts the number by year\r\n  group_by(year_new) %>% \r\n  summarize(count = n())\r\n\r\n# this code chunk outputs a visualization bar graph for the counts by year data\r\nbonanza_count <- ggplot(data = bonanza_stats, aes(x = year_new, y = count)) +\r\n  geom_col(fill = \"#69b3a2\", color = \"black\") + # so the bars are not grey\r\n  theme_classic() + # for a cleaner graph with no gridlines\r\n  labs(x = \"Year\", y = \"Number of juvenile hares\") + # to have formal axis labels \r\n  scale_x_continuous(breaks = 1999:2012) + # to clean up the x-axis year numbering\r\n  scale_y_continuous(n.breaks = 11) # to increase the number of y-axis ticks\r\n  \r\nbonanza_count\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1. Juvenile Bonanza Creek hare counts by year (1998-2012). Data: Kielland et al. 2017.\r\n\r\n\r\n\r\nhide\r\n\r\n# this code chunk outputs summary statistics for in-line use\r\nmax_count <- max(bonanza_stats$count) # to find the maximum count value\r\nmin_count <- min(bonanza_stats$count) # to find the minimum count value\r\nmean_count <- mean(bonanza_stats$count) # to find the mean count across years\r\nsd_count <- sd(bonanza_stats$count) # to find the standard deviation across years\r\nmedian_count <- median(bonanza_stats$count) # to find the median count\r\n\r\n\r\n\r\nCounts of trapped juvenile hares over time were positively skewed, but varied by year with a range of 2 to 126 (min to max). Total trapping counts were generally found to decrease over time, although the data were variable by year. Summary statistics for the annual count totals were also calculated including median annual hare count (18.5) and mean annual hare count (31.5 \\(\\pm\\) 35.88) (mean \\(\\pm\\) standard deviation). Since the data are heavily weighted by the highest counts in earlier years, the median value may be a more representative measure of central tendency.\r\nThe data are presented as absolute counts; therefore, to standardize the results and provide a more representative trend in a future analysis, the counts could be weighted by unit effort. For example, data could be presented as count/number of traps per unit area.\r\nVisualize juvenile hare weights\r\n\r\n\r\nhide\r\n\r\n# this code chunk sets up changes in the bonanza_juvenile dataframe column \"sex\" that are needed later for data visualization\r\n\r\nbonanza_juveniles[\"sex\"][bonanza_juveniles[\"sex\"] == \"m\"] <- \"Male\" # change \"m\" to \"Male\"\r\nbonanza_juveniles[\"sex\"][bonanza_juveniles[\"sex\"] == \"f\"] <- \"Female\" # change \"f\" to \"Female\"\r\n\r\n\r\n\r\nIn this analysis, juvenile hare weights grouped by site and sex are visualized as both raw data (Figure 2) and as summary statistics (Figure 3).\r\n\r\n\r\nhide\r\n\r\n# new facet label names for site (\"grid\") variable\r\nsite.labs <- c(\"Black Spruce\", \"Bonanza Mature\", \"Bonanza Riparian\")\r\nnames(site.labs) <- c(\"bonbs\", \"bonmat\", \"bonrip\")\r\n\r\n# create a jitterplot using bonanza_juveniles dataframe\r\nggplot(data = bonanza_juveniles, aes(x = sex, y = weight, color = sex)) +\r\n  geom_jitter(alpha = 0.8, # change the size and transparency of the points\r\n              size = 3.5) +  \r\n  facet_grid(~ grid,\r\n             labeller = labeller(grid = site.labs)) + # change site label names\r\n\r\n  labs(x = \"Sex\", y = \"Weight (g)\") +\r\n  scale_color_manual(values = c(\"#69b3a2\", \"orange\")) +\r\n  theme_bw() + # cleans up the aesthetics of the overall theme\r\n  theme(plot.title = element_text(hjust = 0.5), # centered title\r\n        panel.grid = element_blank()) + # removes gridlines\r\n  \r\n  guides(color = \"none\", alpha = \"none\") # removes unnecessary legends\r\n\r\n\r\n\r\n\r\nFigure 2: Figure 2. Raw weight (g) data for Bonanza Creek juvenile snowshoe hares grouped by site and sex. Points represent individually trapped female (red) and male (blue) hares. NA points indicate unknown sex (Data: Kielland et al. 2017).\r\n\r\n\r\n\r\nVisualizing the raw data shows a substantial spread in weight (g) across both male and female hares, with a similar pattern represented at each site. Though individuals were highly variable, there are no clear patterns in size differentiation by sex through visualizing the raw data spread. NA points indicate unidentified sex.\r\n\r\n\r\nhide\r\n\r\n# create a boxplot using bonanza_juveniles dataframe\r\nggplot(data = bonanza_juveniles, aes(x = sex, y = weight, \r\n                                     fill = sex)) +\r\n  geom_boxplot() +\r\n# facets by site (grid) and relabels sites and x-axis\r\n  facet_grid(~ grid,\r\n             labeller = labeller(grid = site.labs)) +\r\n  \r\n  theme_bw() + # cleaner graph aesthetics\r\n  scale_fill_brewer(palette=\"Dark2\") +\r\n  theme(plot.title = element_text(hjust = 0.5), # centered title\r\n        panel.grid = element_blank()) + # removes gridlines\r\n  labs(x = \"Sex\", y = \"Weight (g)\") + # cleans up axes labels\r\n  \r\n  guides(fill = \"none\") # removes unnecessary legend\r\n\r\n\r\n\r\n\r\nFigure 3: Figure 3. Summary weight (g) data for Bonanza Creek juvenile snowshoe hares grouped by site and sex. Boxplots represent summary data (median = middle bar) for female (red) and male (blue) hares (Data: Kielland et al. 2017).\r\n\r\n\r\n\r\nFigure 3 presents the data as summary statistics with the middle bar representing the median, the lower and upper hinges corresponding to the first and third quartiles (the 25th and 75th percentiles), and length of the whiskers as a multiple of the inter-quartile range (1.5) (McGill et al. 1978). The medians appear to differ by site and sex, though the quartiles and inter-quartile ranges appear more similar between females and males within sites.\r\nJuvenile weight comparison\r\nIn this data analysis, average female and male weights were compared for all juvenile hare data (Table 1). Exploratory analyses using a histogram and quantile-quantile plot probability distribution suggested the data were fairly normally distributed with the quantiles somewhat linearly related; thus, a t-test was selected for comparison of means.\r\n\r\n\r\nhide\r\n\r\n# these functions group by sex and produce the summary statistics (rounded)\r\nhare_weight_stats <- bonanza_juveniles %>% \r\n  group_by(sex) %>% \r\n  summarize(mean_weight = round(mean(weight, na.rm = TRUE), 2),\r\n            sd_weight = round(sd(weight, na.rm = TRUE), 2),\r\n            sample_size = n())\r\n\r\n# these functions update the table to be cleaner, easier to read, and visually appealing\r\nkable(hare_weight_stats,\r\n      col.names = c(\"Sex\", # changes the column names\r\n                    \"Mean Weight (g)\", \r\n                    \"Standard Deviation (g)\",\r\n                    \"Sample Size\"),\r\n      align = \"lccc\", # changes the alignment of the columns\r\n    \r\n# adds a caption\r\n      caption = \"Table 1. Summary descriptive statistics for mean juvenile male and female snowshoe hare weights (g) at Bonanza Creek 1998-2012 (Data: Kielland et al. 2017).\") %>% \r\n\r\n# better lines within the table\r\nkable_classic(full_width = FALSE)\r\n\r\n\r\n\r\nTable 1: Table 1. Summary descriptive statistics for mean juvenile male and female snowshoe hare weights (g) at Bonanza Creek 1998-2012 (Data: Kielland et al. 2017).\r\n\r\n\r\nSex\r\n\r\n\r\nMean Weight (g)\r\n\r\n\r\nStandard Deviation (g)\r\n\r\n\r\nSample Size\r\n\r\n\r\nFemale\r\n\r\n\r\n855.39\r\n\r\n\r\n292.25\r\n\r\n\r\n200\r\n\r\n\r\nMale\r\n\r\n\r\n945.86\r\n\r\n\r\n333.22\r\n\r\n\r\n163\r\n\r\n\r\nNA\r\n\r\n\r\n614.55\r\n\r\n\r\n357.59\r\n\r\n\r\n15\r\n\r\n\r\nFemale mean snowshoe hare weight (855.39 \\(\\pm\\) 292.25) was found to be significantly lower than male mean hare weight (945.86 \\(\\pm\\) 333.22) (mean \\(\\pm\\) 1 standard deviation) (Welch t-test: t(325) = 2.71; p = 0.007). However, both standard deviation and sample size (n = 200 for females and n = 163 for males) were large.\r\nSince there was a large sample size which can disproportionately affect the statistical significance of the p-value, Cohen’s d was also used to assess effect size (Cohen’s d = 0.29). Since the effect size was small, it is unlikely that a practical difference exists between the male and female weights.\r\nRelationship between juvenile weight and hind foot length\r\nThe relationship between juvenile snowshoe hare weight (g) and hind foot length (mm) was also explored (Figure 4). All juvenile hares were included in the analysis.\r\n\r\n\r\nhide\r\n\r\n# create a scatterplot of hindfoot length to weight of juvenile hares (all)\r\nggplot(data = bonanza_juveniles, aes(x = hindft, \r\n                                     y = weight)) + \r\n  geom_point(aes(alpha = 0.9), # changes transparency and size\r\n             size = 3.5,\r\n             color = \"#69b3a2\") + # changes color to green\r\n  theme_classic() + # cleaner graph output\r\n  labs(x = \"Hind foot length (mm)\", y = \"Weight (g)\") +\r\n  scale_y_continuous(n.breaks = 8) + # to increase the number of y-axis ticks\r\n  scale_x_continuous(n.breaks = 8) + # to increase the number of x-axis ticks\r\n  guides(color = FALSE, size = FALSE, alpha = FALSE) # removes unnecessary legends\r\n\r\n\r\n\r\n\r\nFigure 4: Figure 4. Scatterplot displaying juvenile Bonanza Creek hare weight (g) and hind foot legnth (mm) (Data: Kielland et al. 2017).\r\n\r\n\r\n\r\nA moderate positive correlation was found when determining the strength of the relationship between weight and hind foot length (Pearson’s correlation: r = 0.55, t(247) = 10.26). A Pearson correlation was appropriate because both variables were continuous (rather than ranked).\r\nFurther exploration using a simple linear regression model was conducted to predict weight (dependent) based on hind foot length (independent). The regression found an R2 = 0.299 (F = 105.24, p < 0.001).\r\nThe predicted weight was described using regression Equation 1:\r\n\r\n\r\nhide\r\n\r\nextract_eq(model = hare_lm, use_coefs = TRUE)\r\n\r\n\r\n\\[\r\n\\operatorname{\\widehat{weight}} = -279.34 + 9.52(\\operatorname{hindft})\r\n\\]\r\n\r\nThe slope (9.52) of Equation 1 indicates that on average for every 1 mm increase in hind foot length, we would expect the hare weight to increase by 9.52 grams.\r\nThe results of the regression are suspect due to a lack of meeting the assumptions for a linear regression model, most notably the heteroscedasticity of the residuals and the lack of normality of the residuals in the Q-Q plot. The linearity and independence of errors assumptions seemed to be met. Additionally, since the model only explains 29.9% of the variance for hare weight, it seems likely that other variables are influencing the model that are not analyzed in this report. Logically, it also seems likely that hind foot length alone is not an appropriate predictor of hare weight.\r\nSummary of Findings\r\nThe Kielland et al. (2017) open source Bonanza Creek LTER data from a capture-recapture study conducted on snowshoe hares from 1998-2012 yielded several results:\r\nTotal number of juvenile hare trappings decreased over the study period, though it was not relative to sampling effort, so it is not likely to be reflective of relative population change over time.\r\nJuvenile hare weights were highly variable. Though there was a relative difference found between male (larger) and female (smaller) weights, it is unlikely to represent a real world practical difference.\r\nA moderate positive correlation was found between juvenile hare weight and hind foot length, but the regression (predictor) model did not seem to be a good fit. It is likely that other variables are influencing hare weight.\r\nNext steps:\r\nContinue to explore the data set to see if there are other variables that could be added to the regression model.\r\nCompare some of the juvenile trends to adult hare trends to see if there are similarities.\r\nExplore the trapping data using a measure of effort to standardize across sampling years.\r\nCitations\r\nBonanza Creek Long Term Ecological Research (LTER) program website (https://www.lter.uaf.edu/)\r\nFeierabend, D., K. Kielland. Movements, activity patterns, and habitat use of snowshoe hares (Lepus americanus) in interior Alaska, Journal of Mammalogy, Volume 95, Issue 3, 26 June 2014, Pages 525–533, https://doi.org/10.1644/13-MAMM-A-199\r\nFlora, B.K. 2002. Comparison of snowshoe hare populations in Interior Alaska. M.S. Thesis. University of Alaska-Fairbanks.\r\nGrolemund, G., and H. Wickham (2011). Dates and Times Made Easy with lubridate. Journal of Statistical Software, 40(3), 1-25. URL https://www.jstatsoft.org/v40/i03/.\r\nKielland, K., F.S. Chapin, R.W. Ruess, and Bonanza Creek LTER. 2017. Snowshoe hare physical data in Bonanza Creek Experimental Forest: 1999-Present ver 22. Environmental Data Initiative. https://doi.org/10.6073/pasta/03dce4856d79b91557d8e6ce2cbcdc14\r\nMcGill, R., Tukey, J.W. and Larsen, W.A. (1978) Variations of box plots. The American Statistician 32, 12-16.\r\nMüller, K. (2020). here: A Simpler Way to Find Your Files. R package version 1.0.1. https://CRAN.R-project.org/package=here\r\nR Core Team (2021). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. URL https://www.R-project.org/.\r\nTorchiano M. (2020). effsize: Efficient Effect Size Computation. doi: 10.5281/zenodo.1480624 (URL: https://doi.org/10.5281/zenodo.1480624), R package version 0.8.1, <URL: https://CRAN.R-project.org/package=effsize>.\r\nWickham, H. et al., (2019). Welcome to the tidyverse. Journal of Open Source Software, 4(43), 1686, https://doi.org/10.21105/joss.01686\r\nZhu, H. (2021). kableExtra: Construct Complex Table with ‘kable’ and Pipe Syntax. R package version 1.3.4. https://CRAN.R-project.org/package=kableExtra\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-13-snowshoe/snowshoe_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-03-13T11:46:18-07:00",
    "input_file": "snowshoe.knit.md"
  },
  {
    "path": "posts/2022-03-13-willamette/",
    "title": "Willamette Falls Fish Passage Time Series",
    "description": "This report performs time series analyses on the Willamette Falls fish passage adult salmonid fish data.",
    "author": [
      {
        "name": "Karina Johnston",
        "url": {}
      }
    ],
    "date": "2022-03-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nSalmonid Time Series\r\nSeasonplots\r\nAnnual Counts by Species\r\nCitations\r\n\r\n\r\nOverview\r\n\r\n\r\nhide\r\n\r\nknitr::opts_chunk$set(echo = TRUE, message = FALSE, warning = FALSE)\r\n\r\n# Attach packages\r\nlibrary(tidyverse)\r\nlibrary(here)\r\nlibrary(lubridate)\r\n\r\n# Time series packages\r\nlibrary(tsibble) # df that has special characteristics for time series\r\nlibrary(feasts) # specifically for time series data analyses\r\nlibrary(slider)\r\n\r\nlibrary(patchwork)\r\n\r\n\r\n\r\nColumbia River DART provides an interactive data resource designed for research and management purposes relating to the Columbia Basin salmon populations and river environment. Currently, daily data plus historic information dating back to 1878 are accessible online. Columbia River DART focuses on the Columbia Basin dams and fish passage.\r\nThis report focuses on the Willamette Falls fish passage adult fish data. The historic Willamette Falls Locks are located on the west bank of the Willamette River in West Linn, Oregon. They were built in the early 1870s to move river traffic around the 40-foot horseshoe-shaped basalt ridge between Oregon City and West Linn (USACE 2022). Fish counting through the Willamette Falls fishway occurs at the main viewing window. Video cameras and time lapsed video recorders are used to record fish passage 24 hrs/day, 365 days/year.\r\nThis report includes time series data analyses for three adult fish species, including coho, jack coho, and steelhead salmon. Then a finalized seasonplot for each species was created, and a finalized figure of annual total counts for fish passage for each of the three species.\r\nData Citation: Columbia River DART Adult Passage Inventory Willamette Falls - All Species. Accessed 27 February 2022. Columbia River DART (Data Access in Real Time) www.cbr.washington.edu/dart.\r\n\r\n \r\n\r\nSalmonid Time Series\r\nIn this report section, a finalized static time series graph of adult fish passage counts for coho, jack coho, and steelhead salmon was created (Figure 3), using the facet_wrap() function. Note that the y-axis for each species is the same in each facet of the graph for ease in comparison. Notable observations of the graphs include the appearance of seasonality in the time series data for each species, but with consistently higher counts of adult fish for the steelhead trout species as compared to the coho and jack coho salmon. However, the coho salmon experienced the highest ‘spikes’ or high counts of adult fish over a short time period in the latter years (2009-2010), with counts of over 1,000 individual fish. The coho data also appear to experience the highest variability across the years.\r\n\r\n\r\nhide\r\n\r\n# Read in the data\r\nfish <- read_csv(here(\"data\", \"willamette_fish_passage.csv\")) %>% \r\n  janitor::clean_names()\r\n\r\n# Change the NAs to be zeros\r\nfish[is.na(fish)] <- 0\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n# Subset the fish data for only the three species of interest, change date format\r\n\r\nfish_sub <- fish %>% \r\n  select(project, date, steelhead, coho, jack_coho) %>% \r\n  mutate(date = mdy(date))\r\n\r\nfish_pivot <- fish_sub %>% \r\n  pivot_longer(cols = 3:5, names_to = \"species\", values_to = \"count\")\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\nggplot(data = fish_pivot, aes(x = date, y = count)) +\r\n  geom_line(color = \"darkblue\") +\r\n  facet_wrap(~species, nrow = 3, ncol = 1, labeller = \"label_both\") +\r\n  scale_y_continuous(n.breaks = 6) +\r\n  theme_classic() +\r\n  labs(x = \"Year\", y = \"Count of Adult Fish\")\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 3. Time series graph of counts of three adult fish species in the Columbia River passing a fish ladder in Willamette Falls (Data: Columbia River DART, accessed 2022-02-27).\r\n\r\n\r\n\r\nSeasonplots\r\nIn this report section, a finalized seasonplot was created for each salmonid species in its own panel (i.e., coho, jack coho, and steelhead) using the patchwork package (Figure 4). Each year is represented by a color line with the months on the x-axis. The adult coho and jack coho salmon have consistent high peaks in counts in the month of September each year, while the steelhead trout show a gradual increase in adult counts between February through June, with peaks each year usually occurring in May or June. The max monthly peak count for the jack coho in September is much lower (an order of magnitude) than the coho September counts. The monthly subseries plots show similar patterns (Figure 5).\r\n\r\n\r\nhide\r\n\r\n# convert dataframe to a tsibble using the `as_tsibble()` function\r\n\r\nfish_ts <- fish_sub %>% \r\n  as_tsibble(key = NULL, index = date)\r\n\r\n# summarize each of the fish counts by month\r\n\r\nsteelhead_month <- fish_ts %>% \r\n  index_by(yr_mo = ~yearmonth(.)) %>% \r\n  summarize(monthly_count = mean(steelhead, na.rm = TRUE))\r\n\r\ncoho_month <- fish_ts %>% \r\n  index_by(yr_mo = ~yearmonth(.)) %>% \r\n  summarize(monthly_count = mean(coho, na.rm = TRUE))\r\n\r\njack_coho_month <- fish_ts %>% \r\n  index_by(yr_mo = ~yearmonth(.)) %>% \r\n  summarize(monthly_count = mean(jack_coho, na.rm = TRUE))\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n# use feasts:gg_season() to make seasonplots for each species\r\n\r\nsteelhead_season <- steelhead_month %>% \r\n  gg_season(y = monthly_count, size = 0.7) +\r\n  labs(x = \"Month\", y = \"Adult Fish Count\", title = \"Adult Steelhead Counts\") +\r\n  theme_classic() +\r\n  scale_y_continuous(limits = c(0, 500)) +\r\n  theme(legend.position = \"none\",\r\n        plot.title = element_text(hjust=0.5)) \r\n\r\ncoho_season <- coho_month %>% \r\n  gg_season(y = monthly_count, size = 0.7) +\r\n  labs(x = \"Month\", y = \"Adult Fish Count\", title = \"Adult Coho Counts\") +\r\n  theme_classic() +\r\n  theme(legend.position = \"none\",\r\n        plot.title = element_text(hjust=0.5))\r\n\r\njack_coho_season <- jack_coho_month %>% \r\n  gg_season(y = monthly_count, size = 0.7) +\r\n  labs(x = \"Month\", y = \"Adult Fish Count\", title = \"Adult Jack Coho Counts\") +\r\n  theme_classic() +\r\n  scale_y_continuous(n.breaks = 7) +\r\n  theme(plot.title = element_text(hjust=0.5)) \r\n\r\ncoho_season / jack_coho_season / steelhead_season\r\n\r\n\r\n\r\n\r\nFigure 2: Figure 4. Seasonplot of monthly adult salmonid fish passage data for three species in Willamette Falls (Data: Columbia River DART, accessed 2022-02-27). Note the variable y-axis for the adult jack coho salmon.\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\nsubplot_coho <- coho_month %>% \r\n  gg_subseries(monthly_count) +\r\n  labs(x = \"Year\", y = \"Fish Count\", title = \"Adult Coho Counts\") +\r\n  theme_classic() +\r\n  theme(plot.title = element_text(hjust = 0.5),\r\n        axis.text.x = element_text(angle = 90))\r\n\r\nsubplot_jack <- jack_coho_month %>% \r\n  gg_subseries(monthly_count) +\r\n  labs(x = \"Year\", y = \"Fish Count\", title = \"Adult Jack Coho Counts\") +\r\n  theme_classic() +\r\n  scale_y_continuous(n.breaks = 7) +\r\n  theme(plot.title = element_text(hjust=0.5),\r\n        axis.text.x = element_text(angle = 90))\r\n\r\nsubplot_steelhead <- steelhead_month %>% \r\n  gg_subseries(monthly_count) +\r\n  labs(x = \"Year\", y = \"Fish Count\", title = \"Adult Steelhead Counts\") +\r\n  theme_classic() +\r\n  scale_y_continuous(limits = c(0, 500)) +\r\n  theme(plot.title = element_text(hjust=0.5),\r\n        axis.text.x = element_text(angle = 90))\r\n\r\nsubplot_coho / subplot_jack / subplot_steelhead\r\n\r\n\r\n\r\n\r\nFigure 3: Figure 5. Monthly subseries plots of adult salmonid fish passage data for three species in Willamette Falls (Data: Columbia River DART, accessed 2022-02-27). Note the variable y-axis for the adult jack coho salmon.\r\n\r\n\r\n\r\nAnnual Counts by Species\r\nIn this report section, a finalized figure of annual totals for fish passage for each of the three species of assessment was created (e.g., coho, jack coho, and steelhead) (Figure 6). The total count for all species varied by year, with steelhead showing a slight decline annually since 2002 until an increase in 2010. The annual totals of coho salmon remained fairly low until 2009-2010, when the annual totals increased substantially. Jack coho salmon had the lowest annual counts each year, evaluated comparatively to the other two species. Steelhead consistently had the highest annual total count each year, compared to the other two species, with the exception of 2009, when coho had the highest count.\r\n\r\n\r\nhide\r\n\r\n# create a new dataframe, group by year and sum the counts, pivot longer to make the dataframe tidy\r\n\r\nfish_totals <- fish_sub %>% \r\n  mutate(year = year(date)) %>% \r\n  group_by(year) %>% \r\n  summarize(steelhead_sum = sum(steelhead),\r\n            coho_sum = sum(coho),\r\n            jack_sum = sum(jack_coho)) %>% \r\n  pivot_longer(cols = 2:4,\r\n               names_to = \"species\", values_to = \"counts\")\r\n\r\n# plot the annual totals\r\nggplot(data = fish_totals, aes(x = year, y = counts)) +\r\n  geom_col(aes(fill = species), color = \"black\") +\r\n  scale_fill_manual(values = c(\"darkblue\", \"cornflowerblue\", \"cyan1\"),\r\n                      breaks = c(\"coho_sum\", \"jack_sum\", \"steelhead_sum\"),\r\n                      labels = c(\"Coho\", \"Jack Coho\", \"Steelhead\")) +\r\n  theme_classic() +\r\n  scale_x_continuous(breaks = 2001:2010) +\r\n  scale_y_continuous(n.breaks = 11) +\r\n  labs(x = \"Year\", y = \"Annual Fish Count\",\r\n       title = \"Annual Salmonid Fish Count by Species\") +\r\n  theme(plot.title = element_text(hjust=0.5))\r\n\r\n\r\n\r\n\r\nFigure 4: Figure 6. Annual fish counts for three species of salmonid in Willamette Falls (Data: Columbia River DART, accessed 2022-02-27).\r\n\r\n\r\n\r\nCitations\r\nColumbia River DART Adult Passage Inventory Willamette Falls - All Species. Accessed 27 February 2022. Columbia River DART (Data Access in Real Time) www.cbr.washington.edu/dart.\r\nR Core Team (2021). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. URL https://www.R-project.org/.\r\nWickham, H. et al., (2019). Welcome to the tidyverse. Journal of Open Source Software, 4(43), 1686, https://doi.org/10.21105/joss.01686\r\nOregon Department of Fish and Wildlife, Willamette Falls photograph. Accessed 27 February 2022. https://myodfw.com/willamette-falls-fish-counts\r\nUS Army Corps of Engineers, Willamette Falls map. Accessed 27 February 2022. https://www.nwp.usace.army.mil/willamette/locks/\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-13-willamette/willamette_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-03-13T12:06:15-07:00",
    "input_file": "willamette.knit.md"
  },
  {
    "path": "posts/2022-03-13-amphibians/",
    "title": "Sierra Amphibians Visualization",
    "description": "This report creates a final visualization (two-part graph) of frog count data for the mountain yellow-legged frog using Sierra Lakes Inventory Project data.",
    "author": [
      {
        "name": "Karina Johnston",
        "url": {}
      }
    ],
    "date": "2022-03-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nData Wrangling\r\nData Visualization\r\nCitations\r\n\r\n\r\n\r\nhide\r\n\r\nknitr::opts_chunk$set(echo = TRUE, message = FALSE, warning = FALSE)\r\n\r\n# Attach packages\r\nlibrary(here)\r\nlibrary(tidyverse)\r\nlibrary(readxl) # to read in excel files\r\nlibrary(lubridate) # to update dates\r\nlibrary(cowplot) # to merge the graphs\r\n\r\n\r\n\r\nIntroduction\r\nThe Sierra Lakes Inventory Project (SLIP) was a research endeavor that ran from 1995-2002 and has supported research and management of Sierra Nevada aquatic ecosystems and their terrestrial interfaces. They described the physical characteristics of and surveyed aquatic communities for > 8,000 lentic water bodies in the southern Sierra Nevada, including lakes, ponds, marshes, and meadows (Knapp et al. 2020). The objective of this report was to create a final visualization (two-part graph) of the frog count data for the mountain yellow-legged frog (Rana muscosa).\r\n\r\n\r\nhide\r\n\r\n# Read in the data\r\namphibians <- read_excel(here(\"data\", \"sierra_amphibians.xlsx\")) \r\n\r\n\r\n\r\nData Wrangling\r\nFilter the data to be only the mountain yellow-legged frog (Rana muscosa, code RAMU) and keeping only the life stages of adult, subadult, and tadpole. Mutate the columns to add a new one with “year” using the lubridate package.\r\n\r\n\r\nhide\r\n\r\n# Subset the data\r\n\r\namph_sub <- amphibians %>% \r\n  filter(amphibian_species == \"RAMU\") %>% # choose only Rana muscosa\r\n  filter(amphibian_life_stage != \"EggMass\") %>% # drop the Eggmass category\r\n\r\n  # updates the date column to be Date format and adds a year column \r\n  mutate(date = ymd(survey_date)) %>% \r\n  mutate(year = year(survey_date)) \r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n# Summarize the counts by year\r\n\r\namph_summary <- amph_sub %>% \r\n  group_by(year, amphibian_life_stage) %>% \r\n  summarize(total = sum(amphibian_number))\r\n\r\n\r\n\r\nA second set of data wrangling to count only the adult and subadult mountain yellow-legged frogs and to rename the lake column in the dataframe.\r\n\r\n\r\nhide\r\n\r\n# Subset the data\r\n\r\namph_adult_sub <- amph_sub %>% \r\n  filter(amphibian_life_stage != \"Tadpole\") %>% # delete Tadpoles\r\n  mutate(lake = \"Lake\") %>% # add a new column \"Lake\"\r\n  unite(\"lake_id_new\", lake, lake_id, sep = \" \", remove = FALSE)\r\n# use unite to merge the columns and create a new one to sort by\r\n\r\n# Summarize the counts by lake id \r\namph_adult_summary <- amph_adult_sub %>% \r\n  group_by(lake_id_new) %>% \r\n  summarize(total = sum(amphibian_number)) \r\n\r\n\r\n\r\nData Visualization\r\nCreate (A) a graph of total mountain yellow-legged frog (Rana muscosa) count each year across all water bodies, by life stage excluding the ‘EggMass’ level, and (B) a column graph containing total counts (over all years of the study) of combined adult and subadult endangered mountain yellow-legged frogs observed in the five lakes with the greatest total observed counts.\r\n\r\n\r\nhide\r\n\r\n# Creates a new ggplot figure visualizing amph_summary\r\n\r\nramu_count <- ggplot(data = amph_summary, aes(x = year, y = total)) +\r\n  geom_col(aes(fill = amphibian_life_stage), \r\n           color = \"black\") +\r\n\r\n  # changes fill colors to be more aesthetic\r\n  scale_x_continuous(n.breaks = 5) + # to clean up the x-axis year numbering\r\n  scale_fill_manual(values = c(\"blue\", \"light blue\", \"yellow\"), \r\n                    name = \"Life Stage\") +\r\n  scale_y_continuous(labels = scales::comma, n.breaks = 8) +\r\n\r\n  # updates the axis labels\r\n  labs(x = \"Year\", y = \"Total Number of Frogs\") +\r\n\r\n  theme_classic() # clean theme\r\n\r\n\r\n\r\n\r\n\r\nhide\r\n\r\n# Create a second visualization bar graph with totals by lake\r\n\r\nramu_adult <- amph_adult_summary %>% \r\n  \r\n  # to reorder and cut the top 5 lakes from the dataframe\r\n  mutate(lake_id_new = fct_reorder(lake_id_new, desc(total))) %>% \r\n  slice_max(order_by = total, n = 5) %>% \r\n  \r\n# Create the new ggplot using the adult frog data\r\n ggplot(aes(x = lake_id_new, \r\n                         y = total)) + \r\n  geom_col(fill = \"blue\", \r\n           color = \"black\",\r\n           width = 0.5) + \r\n  theme_classic() + \r\n#  coord_flip() +\r\n  labs(x = \"Lake ID\", y = \"Total Number of Frogs\") +\r\n  scale_y_continuous(labels = scales::comma, n.breaks = 10) \r\n\r\n\r\n# Use the cowplot package to merge the plots into one figure\r\nplot_grid(ramu_count, ramu_adult, \r\n          labels = c(\"A\", \"B\"), \r\n          label_size = 12)\r\n\r\n\r\n\r\n\r\nFigure 1: Figure 1. Sierra Lakes mountain yellow-legged frog (Rana muscosa) counts: (A) by year and life stage across all waterbodies, and (B) combined adult and subadult counts for the top five waterbodies (Data: Knapp et al. 2020).\r\n\r\n\r\n\r\nCitations\r\nKnapp, R.A., C. Pavelka, E.E. Hegeman, and T.C. Smith. 2020. The Sierra Lakes Inventory Project: Non-Native fish and community composition of lakes and ponds in the Sierra Nevada, California ver 2. Environmental Data Initiative. https://doi.org/10.6073/pasta/d835832d7fd00d9e4466e44eea87fab3\r\nR Core Team (2021). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. URL https://www.R-project.org/.\r\nWickham, H. et al., (2019). Welcome to the tidyverse. Journal of Open Source Software, 4(43), 1686, https://doi.org/10.21105/joss.01686\r\nWickham, H. and J. Bryan (2019). readxl: Read Excel Files. R package version 1.3.1. https://CRAN.R-project.org/package=readxl\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-13-amphibians/amphibians_files/figure-html5/unnamed-chunk-6-1.png",
    "last_modified": "2022-03-13T12:15:11-07:00",
    "input_file": "amphibians.knit.md"
  },
  {
    "path": "posts/2022-03-12-welcome/",
    "title": "Welcome",
    "description": "This is a brief introduction post.",
    "author": [
      {
        "name": "Karina Johnston",
        "url": {}
      }
    ],
    "date": "2022-02-10",
    "categories": [],
    "contents": "\r\nWelcome to my website! Thank you for visiting. Within this website, you will find some summary professional information about me, as well as a copy of my CV, and portfolio examples of my work in the field of ecology, marine science, coastal resilience, and burgeoning data science. While this site is focused on the presentation of data science and coding materials, there are also several examples of restoration ecology and implementation of restoration projects, including wetlands, beaches, and dunes.\r\nPlease don’t hesitate to reach out to me for more information. Enjoy!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-03-13T00:17:25-08:00",
    "input_file": {}
  }
]
